print("=== โปรแกรมคำนวณการใช้สีทาบ้านภายนอก ===")
wide = float(input("กรุณากรอก ความกว้าง ของบ้าน (เมตร): "))
long = float(input("กรุณากรอก ความยาว ของบ้าน (เมตร): "))
high = float(input("กรุณากรอก ความสูง ของบ้าน (เมตร): "))

color = 2.5

area =  (wide*high*2) + (long*high*2) #คำนวณหา พื้นที่
lit = area/color #หาจำนวนลิตรที่ต้องใช้
buycolor = lit/4 # หาจำนวนสีที่ต้องซื้อ

#การแสดงผล
print("=== สรุปผลการคำนวณ ===")   
print(f"พื้นที่ผนังภายนอกทั้งหมด: {area:.2f} ตารางเมตร")
print(f"ปริมาณสีที่ต้องใช้รวม: {lit:.2f} ลิตร")
print(f"จำนนวนสีกระป๋องที่ต้องการซื้อ {int(buycolor)} กระป๋อง")
print(f"จำนวนเงินค่าสีทั้งหมด {int(buycolor*200):,} บาท")
